`后台服务器---------------------------------------------------------------------------------------------------------------
        地址：http://miaodaokeji.com/miaodao.php/Public/index
        账号：fjmd
        密码：123456

超管--------------------------------------------------------------------------------------------------------------------
        账号：miaodaokeji
        密码：bante987
    FTP--------------------------
        地址：120.27.209.30
        账号：test1/root
        密码：mdsoftp88/MiaoDaoJiO1
    后台--------------------------
        账号:miaodaokeji
        密码:mdkj789

测试服务器---------------------------------------------------------------------------------------------------------------
        地址：http://miaodaokeji.com/miaodao.php/Public/index
        账号：admin@miaodaokeji.com
        密码：123456
    FTP--------------------------
        地址：39.107.77.1
        账号：test1
        密码：mdsoftp88

阿里云-------------------------------------------------------------------------------------------------------------------
    正式版------------------------
        阿里云账号：15968855345
        阿里云密码:  wuhe871317
        数据库账号：miaodao_myadmin
        数据库密码：Miaodao_00
        shell账号: root
        shell密码: MiaoDaoJiO1
    测试版------------------------
        账号: 2080581547ZHANG
        密码: fjmd_csvvm2GOR7
        数据库账号: miaodaokeji1
        数据库密码: Miao_dao88

    商城小程序--------------------------------------------------------------------------------------------------------------
-----------------------------------------------
        控制台登录用户名：hyu7751630001
        控制台登录密码: Miaodao@88

        主机ip: 120.26.69.207
        FTP登录用户名： hyu7751630001
        FTP登录密码： Miaodao$88
        数据库账号： hdm721891322
        数据库登录密码： Root@md88
-------------------------------------------------



连丰电子(支付宝小程序管理后台)
    账号:3479204570@qq.com
    密码:miaodao00
平台登录信息:
    user:   lfdsz
    pwd:    lfdsz88

秒道-329 ****************************************************************************************************************
    微信---------------------------
        账号：3416823716@qq.com
        密码：zyh164320
    支付宝-------------------------
        APPID：2019022063291069
        账号：fjmdkj@126.com
        密码：miaodao00
    摩吧IOT后台---------------------
        账号:zts
        密码:zts888
巨帆亿客莱    -5501 ******************************************************************************************************
    微信--------------------------
        账号：yikelaiwangluokeji@163.com
        密码：yikelai888
        APPID: wx0e7c7679d4a22b68
        AppSecret: fab4e3d31f78af4d0f1267c9b94559bc
    支付宝------------------------
        登录账号：henanjufanshiye@163.com
        登录密码：jfsy1618！

沃代付       -5491 ******************************************************************************************************
    支付宝------------------------
        小程序账号：sopays@sopays.com
        密码：sopays@sopays

联丰   -5597*************************************************************************************************************
    支付宝------------------------
        账号：cjm@lanyycn.com
        密码：gdlf123456
    平台-------------------------
        user:   lianfeng
        pwd:    123456

东润 -4876***************************************************************************************************************
    支付宝------------------------
        账号: 18018931777@163.com
        密码: abc123456
    微信--------------------------
        账号：1627624161@qq.com
        密码：zsd19940218
东润平台登录信息
    账号：dongrun
    密码：frs123456

博枝展 -5504*************************************************************************************************************
    支付宝-------------------------
        账号：811897586@qq.com
        密码：Bzz13311811899

同生源  (福稳物联)-5575 ************************************************************************************************************
    支付宝--------------------------
        账号: tsykj8899@126.com
        密码: tsykj8899

胤然   -6308    *********************************************************************************************************
    支付宝--------------------------
        账号: 13910718345@139.com
        密码: yinran8345

福州秒道 连丰共享  -5873   ************************************************************************************************
    支付宝--------------------------
        账号: 3479204570@qq.com
        密码: miaodao00

康培宁 -- 4810  ****************************************************************************************************************
    公众平台-----------------------
        账号: lykangpeining@126.com
        密码: Kangpeining88
    后台---------------------------
        账号:kpn
        密码：4006699697

九区 -- 1298   *****************************************************************************************************************
        账号：jqkj
        密码：tianZONG411221

小明科技 -- 541  *******************************
    账号：fjxmkj
    密码：xmkj
    小明科技的商家登录信息：   密码基本为登录账号+123

杭州久长宝科技 - 7051   *****************************************************************************************************************
    支付宝登录账号：hzjcbkjyxgs@163.com
    登录密码：jcb190814
    支付密码：jcb123
    久长宝科技客服电话：13136186613

    久长宝管理后台:
        账号: hzlz
        密码：123456


杭州聚洲科技(吾机科技 7756)   *******************************
    企业支付宝账号:	wuji18969921714@163.com
    密码： wuji654321
    支付密码: wuji123456

    管理后台:
        账号：juzhou
        密码：123456

 北京千企云   1479  ***************************************
    管理后台:
    账号：bjqqy
    密码：123456

/*****流量方法测试信息*****/
流量费测试商家账号
    管理员账号：fjmd
    密码：123456

    商家账号：fjshangjia
    密码：123456



30 10,14 * * * /usr/bin/php  /www/html/devcrontab.php  Remind/sendMangeSms



public function ip() {
    //strcasecmp 比较两个字符，不区分大小写。返回0，>0，<0。
    if(getenv('HTTP_CLIENT_IP') && strcasecmp(getenv('HTTP_CLIENT_IP'), 'unknown')) {
    $ip = getenv('HTTP_CLIENT_IP');
    } elseif(getenv('HTTP_X_FORWARDED_FOR') && strcasecmp(getenv('HTTP_X_FORWARDED_FOR'), 'unknown')) {
    $ip = getenv('HTTP_X_FORWARDED_FOR');
    } elseif(getenv('REMOTE_ADDR') && strcasecmp(getenv('REMOTE_ADDR'), 'unknown')) {
    $ip = getenv('REMOTE_ADDR');
    } elseif(isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] && strcasecmp($_SERVER['REMOTE_ADDR'], 'unknown')) {
    $ip = $_SERVER['REMOTE_ADDR'];
    }
    $res =  preg_match ( '/[\d\.]{7,15}/', $ip, $matches ) ? $matches [0] : '';
    return $ip;
}
$ip = sprintf('%u',ip2long(ip());
$begin = sprintf('%u',ip2long('111.111.111.111'))
$end = sprintf('%u',ip2long('222.222.222.222'))
if($ip > $begin && $ip < $end) {
echo "在这个区间里"。
}


ip2long($ip_address) — 将 IPV4 的字符串互联网协议转换成长整型数字;  返回IP地址转换后的数字或FALSE(如果ip_address是无效的)
gethostbyname($hostname) — 返回主机名对应的 IPv4地址;  成功时返回IPv4地址,失败时原封不动返回hostname字符串
strcasecmp($str1,$str2) — 二进制安全比较字符串（不区分大小写）,如果str1小于str2返回<0; 如果str1大于str2返回>0;如果两者相等,返回0.
$ip   = gethostbyname('www.example.com');
$long = ip2long($ip);

if ($long == -1 || $long === FALSE) {
echo 'Invalid IP, please try again';
} else {
echo $ip   . "\n";           // 192.0.34.166
echo $long . "\n";           // -1073732954
printf("%u\n", ip2long($ip)); // 3221234342
}

//getenv() 与 $_SERVER

// getenv() 使用示例
$ip = getenv('REMOTE_ADDR');

// 或简单仅使用全局变量（$_SERVER 或 $_ENV）
$ip = $_SERVER['REMOTE_ADDR'];

// 安全地获取环境变量，忽略通过 SAPI 或 putenv 修改的值
$ip = getenv('REMOTE_ADDR', true) ?: getenv('REMOTE_ADDR')



















